Revit 2026 API

# DataTransferMode Enumeration

---

Describes the data transfer mode.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DataTransferMode
```
```vb
Public Enumeration DataTransferMode
```
```cpp
public enum class DataTransferMode
```
```fsharp
type DataTransferMode
```

| Member name | Value | Description |
| --- | --- | --- |
| Download | 0 | Transfer data from server to client. |
| Undefined | -1 | Undefined mode. |
| Upload | 1 | Transfer data from client to server. |

#### Reference

Autodesk.Revit.DB.Events Namespace